InformationRegisters/СостоянияЗагрузкиДанныхИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЗагрузкиДанныхИзВнешнихИсточников</Name>
			<Comment>#15612</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗагрузкаДанныхИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОбъектовЗагрузкиИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовЗагрузкиИзВнешнихИсточников</Name>
			<Comment>#15612</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправочникНоменклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУстановкаЦенНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыИсточниковЗагрузкиИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыИсточниковЗагрузкиИзВнешнихИсточников</Name>
			<Comment>#15612</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФайлExcel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлExcelURL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлCSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлCSVURL</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка_ТранспортСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение_СообщениеОбменаБылоРанееПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоСПредупреждениями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПоискаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыПоискаНоменклатуры</Name>
			<Comment>#15612</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоПоНаименованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоПоАртикулу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоАртикулуПоНаименованиюВместе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаименованиюПоАртикулу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоАртикулуПоНаименованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>Установка цен на номенклатуру</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрировытьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЗагрузкаДанныхИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЗагрузкаДанныхИзВнешнихИсточников</Name>
			<Comment>#15612</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНовойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНовойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияНовойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьТолькоИзмененныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсточниковЗагрузкиИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкаФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиАртикул</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНаименование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиХарактеристика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНачальнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовЗагрузкиИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделительCSV</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПоискаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоискаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьДанныеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗагрузкаДанныхИзВнешнихИсточников/Ext/Module.bsl
Процедура ЗагрузкаДанныхИзВнешнихИсточников(КодЭлемента) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ЗагрузкаДанныхИзВнешнихИсточников);
	
	НастройкаЗагрузки = Справочники.ЗагрузкаДанныхИзВнешнихИсточников.НайтиПоКоду(КодЭлемента);
	
	Если НЕ ЗначениеЗаполнено(НастройкаЗагрузки) Тогда
		ТекстОшибки = "Не найден элемент с кодом" + " " + КодЭлемента;
		ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
		Возврат;		
	КонецЕсли;
	
	ЗагрузкаДанных(НастройкаЗагрузки);

КонецПроцедуры
	
Процедура ЗагрузкаДанных(НастройкаЗагрузки) Экспорт

	ПараметрыЗагрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаЗагрузки, "ОбъектЗагрузки, Источник");
	РезультатЗагрузки = Ложь;
	ДатаНачала = ТекущаяДатаСеанса();
	
	Если ПараметрыЗагрузки.ОбъектЗагрузки = Перечисления.ТипыОбъектовЗагрузкиИзВнешнихИсточников.СправочникНоменклатура Тогда
		Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcel 
			ИЛИ ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcelURL
			Тогда
			РезультатЗагрузки = Загрузить_СправочникНоменклатура_ИзExcel(НастройкаЗагрузки);
			
		ИначеЕсли ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSV 
			ИЛИ ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL
			Тогда
			РезультатЗагрузки = Загрузить_СправочникНоменклатура_ИзCSV(НастройкаЗагрузки);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыЗагрузки.ОбъектЗагрузки = Перечисления.ТипыОбъектовЗагрузкиИзВнешнихИсточников.ДокументУстановкаЦенНоменклатуры Тогда		
		Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcel 
			ИЛИ ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcelURL Тогда
			РезультатЗагрузки = Загрузить_ДокументУстановкаЦенНоменклатуры_ИзExcel(НастройкаЗагрузки);
			
		ИначеЕсли ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSV 
			ИЛИ ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL
			Тогда
			РезультатЗагрузки = Загрузить_ДокументУстановкаЦенНоменклатуры_ИзCSV(НастройкаЗагрузки);

		КонецЕсли;
		
	КонецЕсли;
	
	// состояние обмена
	ЗафиксироватьСостояниеЗагрузки(НастройкаЗагрузки, ДатаНачала, РезультатЗагрузки);
	
КонецПроцедуры

Функция ПолучитьПутьКФайлу(ПараметрыЗагрузки)
	
	ПутьКФайлу = ПараметрыЗагрузки.ПутьКФайлу;
	
	Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcelURL Тогда
		
		РезультатЗагрузкиФайла = ОбщийМодульКлиентСервер.ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗагрузки.ПутьКФайлу, Ложь, ".xlsx");
		//РезультатЗагрузкиФайла = ОбщийМодульКлиентСервер.ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗагрузки.ПутьКФайлу, Ложь, ".xls");
		Если НЕ РезультатЗагрузкиФайла.КодОтвета = 200 Тогда
			ТекстОшибки = "Ошибка загрузки файла по URL, код: " + " " + РезультатЗагрузкиФайла.КодОтвета;
			ЗафиксироватьОшибкуЗагрузки(ПараметрыЗагрузки.Ссылка, ТекстОшибки);		
			Возврат Ложь;	
		КонецЕсли;
		ПутьКФайлу = РезультатЗагрузкиФайла.ПутьКФайлу;
		
	ИначеЕсли ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL Тогда

		РезультатЗагрузкиФайла = ОбщийМодульКлиентСервер.ПолучитьФайлЗаписиПоHttpСсылке(ПараметрыЗагрузки.ПутьКФайлу, Ложь, ".csv");
		Если НЕ РезультатЗагрузкиФайла.КодОтвета = 200 Тогда
			ТекстОшибки = "Ошибка загрузки файла по URL, код: " + " " + РезультатЗагрузкиФайла.КодОтвета;
			ЗафиксироватьОшибкуЗагрузки(ПараметрыЗагрузки.Ссылка, ТекстОшибки);		
			Возврат Ложь;	
		КонецЕсли;
		ПутьКФайлу = РезультатЗагрузкиФайла.ПутьКФайлу;
		
	КонецЕсли;
	
	Возврат ПутьКФайлу;
	
КонецФункции

Функция ПустаяТаблицаЗагрузкиНоменклатуры()
	
	ДанныеКЗагрузке = Новый ТаблицаЗначений;
	ДанныеКЗагрузке.Колонки.Добавить("Наименование");
	ДанныеКЗагрузке.Колонки.Добавить("НаименованиеДляПечати");
	ДанныеКЗагрузке.Колонки.Добавить("ЕдиницаИзмеренияСтрокой");
	ДанныеКЗагрузке.Колонки.Добавить("Артикул");
	ДанныеКЗагрузке.Колонки.Добавить("Характеристика");
	
	ДанныеКЗагрузке.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеКЗагрузке.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДанныеКЗагрузке.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	
	Возврат ДанныеКЗагрузке;
	
КонецФункции

Функция ПустаяТаблицаЗагрузкиЦенНоменклатуры()
	
	ДанныеКЗагрузке = Новый ТаблицаЗначений;
	ДанныеКЗагрузке.Колонки.Добавить("Наименование");
	ДанныеКЗагрузке.Колонки.Добавить("ЕдиницаИзмеренияСтрокой");
	ДанныеКЗагрузке.Колонки.Добавить("Артикул");
	ДанныеКЗагрузке.Колонки.Добавить("Характеристика");
	ДанныеКЗагрузке.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", ,, Новый КвалификаторыЧисла(15,2)));
	
	ДанныеКЗагрузке.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеКЗагрузке.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДанныеКЗагрузке.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	
	Возврат ДанныеКЗагрузке;
		
КонецФункции

Функция Загрузить_СправочникНоменклатура_ИзExcel(НастройкаЗагрузки)
	
	ТекстОшибки = "";
	
	ПараметрыЗагрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаЗагрузки, "Ссылка, Источник, ПутьКФайлу, 
																					  |СпособПоискаНоменклатуры, 
																					  |ВидНовойНоменклатуры, ГруппаНовойНоменклатуры, ЕдиницаИзмеренияНовойНоменклатуры,
																					  |НомерНачальнойСтроки, НомерКолонкиНаименование, НомерКолонкиНаименованиеДляПечати,
																					  |НомерКолонкиХарактеристика, НомерКолонкиАртикул, НомерКолонкиЕдиницаИзмерения,
																					  |ОбновлятьДанныеНоменклатуры");
	
	ПутьКФайлу = ПолучитьПутьКФайлу(ПараметрыЗагрузки);
		
	ТабличныйДокумент = ПрочитатьФайлExcelВТабличныйДокумент(ПутьКФайлу, ТекстОшибки);
	
	Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcelURL  Тогда
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;
	
	Если ТабличныйДокумент = Неопределено Тогда 
		ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеКЗагрузке = ПустаяТаблицаЗагрузкиНоменклатуры();
		
	КоличествоСтрок = ТабличныйДокумент.ПолучитьРазмерОбластиДанныхПоВертикали();
	КоличествоКолонок = ТабличныйДокумент.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	
	Для НомерСтроки = ПараметрыЗагрузки.НомерНачальнойСтроки По КоличествоСтрок Цикл
		Попытка
			Наименование = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиНаименование);
			Если НЕ ЗначениеЗаполнено(Наименование) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЗ = ДанныеКЗагрузке.Добавить();
			СтрокаТЗ.Наименование = Наименование;
			СтрокаТЗ.НаименованиеДляПечати =  ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиНаименованиеДляПечати);
			СтрокаТЗ.ЕдиницаИзмеренияСтрокой = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиЕдиницаИзмерения);								
			СтрокаТЗ.Артикул = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиАртикул);					
			СтрокаТЗ.Характеристика = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиХарактеристика);
			
		Исключение
			ТекстОшибки = "Ошибка чтения строки файла " + НомерСтроки + Символы.ПС + ОписаниеОшибки();
			ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	ИдентифицироватьНоменклатуру(ДанныеКЗагрузке, ПараметрыЗагрузки.СпособПоискаНоменклатуры, ПараметрыЗагрузки.ЕдиницаИзмеренияНовойНоменклатуры);
	Результат = СоздатьНоменклатуруПоТаблице(ДанныеКЗагрузке, ПараметрыЗагрузки);
	
	Возврат Результат;
	
КонецФункции

Функция Загрузить_СправочникНоменклатура_ИзCSV(НастройкаЗагрузки)
	
	ТекстОшибки = "";
	
	ПараметрыЗагрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаЗагрузки, "Ссылка, Источник, ПутьКФайлу, РазделительCSV, КодировкаФайла,
																					  |СпособПоискаНоменклатуры, 
																					  |ВидНовойНоменклатуры, ГруппаНовойНоменклатуры, ЕдиницаИзмеренияНовойНоменклатуры,
																					  |НомерНачальнойСтроки, НомерКолонкиНаименование, НомерКолонкиНаименованиеДляПечати,
																					  |НомерКолонкиХарактеристика, НомерКолонкиАртикул, НомерКолонкиЕдиницаИзмерения,
																					  |ОбновлятьДанныеНоменклатуры");
	
	ПутьКФайлу = ПолучитьПутьКФайлу(ПараметрыЗагрузки);
		
	МассивСтрок = ОбщийМодульКлиентСервер.ПрочитатьФайлCSV(ПутьКФайлу, ПараметрыЗагрузки.КодировкаФайла, ПараметрыЗагрузки.НомерНачальнойСтроки, ТекстОшибки);
	
	Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL Тогда
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;
	
	Если МассивСтрок.Количество() = 0 Тогда 
		ТекстОшибки = "Файл загрузки пуст";
		ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеКЗагрузке = ПустаяТаблицаЗагрузкиНоменклатуры();
	
	РазделительCSV = ?(НЕ ПустаяСтрока(ПараметрыЗагрузки.РазделительCSV), ПараметрыЗагрузки.РазделительCSV, ";");
	
	Для каждого СтрокаФайл из МассивСтрок Цикл
		
		ЭлементыСтроки = СтрРазделить(СтрокаФайл, РазделительCSV, Истина);
		
		Попытка
			Наименование = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиНаименование);
			Если НЕ ЗначениеЗаполнено(Наименование) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЗ = ДанныеКЗагрузке.Добавить();
			СтрокаТЗ.Наименование = Наименование;
			СтрокаТЗ.НаименованиеДляПечати =  ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиНаименованиеДляПечати);
			СтрокаТЗ.ЕдиницаИзмеренияСтрокой = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиЕдиницаИзмерения);								
			СтрокаТЗ.Артикул = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиАртикул);					
			СтрокаТЗ.Характеристика = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиХарактеристика);
			
		Исключение
			ТекстОшибки = "Ошибка чтения строки файла " + СтрокаФайл + Символы.ПС + ОписаниеОшибки();
			ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	ИдентифицироватьНоменклатуру(ДанныеКЗагрузке, ПараметрыЗагрузки.СпособПоискаНоменклатуры, ПараметрыЗагрузки.ЕдиницаИзмеренияНовойНоменклатуры);
	Результат = СоздатьНоменклатуруПоТаблице(ДанныеКЗагрузке, ПараметрыЗагрузки);
	
	Возврат Результат;
	
КонецФункции

Функция Загрузить_ДокументУстановкаЦенНоменклатуры_ИзExcel(НастройкаЗагрузки)
	
	ТекстОшибки = "";
	
	ПараметрыЗагрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаЗагрузки, "Ссылка, Источник, ПутьКФайлу, 
																					  |СпособПоискаНоменклатуры, 
																					  |ВидНовойНоменклатуры, ГруппаНовойНоменклатуры, ЕдиницаИзмеренияНовойНоменклатуры,
																					  |НомерНачальнойСтроки, НомерКолонкиНаименование, НомерКолонкиХарактеристика,
																					  |НомерКолонкиАртикул, НомерКолонкиЕдиницаИзмерения, НомерКолонкиЦена,
																					  |ВидЦены, ЗагружатьТолькоИзмененныеЦены");
	
	ПутьКФайлу = ПолучитьПутьКФайлу(ПараметрыЗагрузки);
	
	ТабличныйДокумент = ПрочитатьФайлExcelВТабличныйДокумент(ПутьКФайлу, ТекстОшибки);
	
	Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлExcelURL  Тогда
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;
	
	Если ТабличныйДокумент = Неопределено Тогда 
		ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеКЗагрузке = ПустаяТаблицаЗагрузкиЦенНоменклатуры();
	
	КоличествоСтрок = ТабличныйДокумент.ПолучитьРазмерОбластиДанныхПоВертикали();
	КоличествоКолонок = ТабличныйДокумент.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	
	Для НомерСтроки = ПараметрыЗагрузки.НомерНачальнойСтроки По КоличествоСтрок Цикл
		Попытка
			Наименование = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиНаименование);
			Если НЕ ЗначениеЗаполнено(Наименование) Тогда
				Продолжить;
			КонецЕсли;
			
			ЦенаСтрокой = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиЦена);
			Если НЕ ЗначениеЗаполнено(ЦенаСтрокой) Тогда
				Продолжить;
			КонецЕсли;

			Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЦенаСтрокой);
			Если Цена = Неопределено ИЛИ Цена = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			СтрокаТЗ = ДанныеКЗагрузке.Добавить();
			СтрокаТЗ.Наименование = Наименование;
			СтрокаТЗ.ЕдиницаИзмеренияСтрокой = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиЕдиницаИзмерения);								
			СтрокаТЗ.Артикул = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиАртикул);					
			СтрокаТЗ.Характеристика = ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, ПараметрыЗагрузки.НомерКолонкиХарактеристика);
			
			СтрокаТЗ.Цена = Цена;
		Исключение
			ТекстОшибки = "Ошибка чтения строки файла " + НомерСтроки + Символы.ПС + ОписаниеОшибки();
			ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	ИдентифицироватьНоменклатуру(ДанныеКЗагрузке, ПараметрыЗагрузки.СпособПоискаНоменклатуры);
	
	Результат = СоздатьУстановкуЦенПоТаблице(ДанныеКЗагрузке, ПараметрыЗагрузки);
	
	Возврат Результат;
	
КонецФункции

Функция Загрузить_ДокументУстановкаЦенНоменклатуры_ИзCSV(НастройкаЗагрузки)
	
	ТекстОшибки = "";
	
	ПараметрыЗагрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаЗагрузки, "Ссылка, Источник, ПутьКФайлу, РазделительCSV, КодировкаФайла,
																					  |СпособПоискаНоменклатуры, 
																					  |ВидНовойНоменклатуры, ГруппаНовойНоменклатуры, ЕдиницаИзмеренияНовойНоменклатуры,
																					  |НомерНачальнойСтроки, НомерКолонкиНаименование, НомерКолонкиХарактеристика,
																					  |НомерКолонкиАртикул, НомерКолонкиЕдиницаИзмерения, НомерКолонкиЦена,
																					  |ВидЦены, ЗагружатьТолькоИзмененныеЦены");
	
	ПутьКФайлу = ПолучитьПутьКФайлу(ПараметрыЗагрузки);
	
	МассивСтрок = ОбщийМодульКлиентСервер.ПрочитатьФайлCSV(ПутьКФайлу, ПараметрыЗагрузки.КодировкаФайла, ПараметрыЗагрузки.НомерНачальнойСтроки, ТекстОшибки);
	
	Если ПараметрыЗагрузки.Источник = Перечисления.ТипыИсточниковЗагрузкиИзВнешнихИсточников.ФайлCSVURL Тогда
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;
	
	Если МассивСтрок.Количество() = 0 Тогда 
		ТекстОшибки = "Файл загрузки пуст";
		ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеКЗагрузке = ПустаяТаблицаЗагрузкиЦенНоменклатуры();
	
	РазделительCSV = ?(НЕ ПустаяСтрока(ПараметрыЗагрузки.РазделительCSV), ПараметрыЗагрузки.РазделительCSV, ";");
	
	Для каждого СтрокаФайл из МассивСтрок Цикл
		
		ЭлементыСтроки = СтрРазделить(СтрокаФайл, РазделительCSV, Истина);

		Попытка
			Наименование = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиНаименование);
			Если НЕ ЗначениеЗаполнено(Наименование) Тогда
				Продолжить;
			КонецЕсли;
			
			ЦенаСтрокой = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиЦена);
			Если НЕ ЗначениеЗаполнено(ЦенаСтрокой) Тогда
				Продолжить;
			КонецЕсли;

			Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЦенаСтрокой);
			Если Цена = Неопределено ИЛИ Цена = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			СтрокаТЗ = ДанныеКЗагрузке.Добавить();
			СтрокаТЗ.Наименование = Наименование;
			СтрокаТЗ.ЕдиницаИзмеренияСтрокой = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиЕдиницаИзмерения);								
			СтрокаТЗ.Артикул = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиАртикул);					
			СтрокаТЗ.Характеристика = ЗначениеИзМассива(ЭлементыСтроки, ПараметрыЗагрузки.НомерКолонкиХарактеристика);
			
			СтрокаТЗ.Цена = Цена;
		Исключение
			ТекстОшибки = "Ошибка чтения строки файла " + СтрокаФайл + Символы.ПС + ОписаниеОшибки();
			ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки);		
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	ИдентифицироватьНоменклатуру(ДанныеКЗагрузке, ПараметрыЗагрузки.СпособПоискаНоменклатуры);
	
	Результат = СоздатьУстановкуЦенПоТаблице(ДанныеКЗагрузке, ПараметрыЗагрузки);
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьФайлExcelВТабличныйДокумент(ПутьКФайлуНаСервере, ТекстОшибки) Экспорт
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ФайлЗагрузки = Новый Файл(ПутьКФайлуНаСервере);
	Если НЕ ФайлЗагрузки.Существует() Тогда
		ТекстОшибки = "Файл недоступен или не существует";
		Возврат Неопределено;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ТабличныйДокумент.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		Возврат ТабличныйДокумент;
	Исключение
		ТекстОшибки = "Не удалось прочитать файл Excel: " + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Процедура ЗафиксироватьОшибкуЗагрузки(НастройкаЗагрузки, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации("Загрузка данных из внешних источников",
			УровеньЖурналаРегистрации.Ошибка,
			НастройкаЗагрузки.Метаданные(),
			НастройкаЗагрузки,
			ТекстОшибки);
			
КонецПроцедуры
		
Процедура ЗафиксироватьСостояниеЗагрузки(НастройкаЗагрузки, ДатаНачала, Успешно = Истина)
	
	МенеджерЗаписи = РегистрыСведений.СостоянияЗагрузкиДанныхИзВнешнихИсточников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НастройкаЗагрузки = НастройкаЗагрузки;
	МенеджерЗаписи.РезультатВыполнения = ?(Успешно, Перечисления.РезультатыВыполненияОбмена.Выполнено, Перечисления.РезультатыВыполненияОбмена.Ошибка);
	МенеджерЗаписи.ДатаНачала = ДатаНачала;
	МенеджерЗаписи.ДатаОкончания = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ЗначениеИзОбласти(ТабличныйДокумент, НомерСтроки, НомерКолонки, ЗначениеПоУмолчанию = "")
	
	Если НомерКолонки = 0 ИЛИ НомерСтроки = 0 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат СокрЛП(ТабличныйДокумент.Область("R" + Формат(НомерСтроки, "ЧГ=") +"C" + Формат(НомерКолонки, "ЧГ=")).Текст);
			
	//ЗначениеЯчейки = МассивДанных[НомерСтроки];
	//Если ЗначениеЯчейки = Неопределено Тогда
	//	Возврат ЗначениеПоУмолчанию;
	//Иначе
	//	Если ТипЗнч(ЗначениеЯчейки) = Тип("Число") Тогда
	//		ЗначениеЯчейки = Формат(ЗначениеЯчейки, "ЧГ=");
	//		
	//	ИначеЕсли ТипЗнч(ЗначениеЯчейки) = Тип("Дата") Тогда
	//		ЗначениеЯчейки = Формат(ЗначениеЯчейки, "ДФ=dd.MM.yyyy");
	//	Иначе
	//		ЗначениеЯчейки = СокрЛП(ЗначениеЯчейки);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Возврат ЗначениеЯчейки;
	
КонецФункции

Функция ЗначениеИзМассива(МассивЗначений, НомерКолонки, ЗначениеПоУмолчанию = "")

	Если НомерКолонки = 0 ИЛИ МассивЗначений.Количество() < НомерКолонки Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	//Возврат СокрЛП(МассивЗначений[НомерКолонки-1]);
	Возврат ОбщийМодульКлиентСервер.ОбрезатьСтрокуCSV(МассивЗначений[НомерКолонки-1]);
	
КонецФункции

Процедура ИдентифицироватьНоменклатуру(ТаблицаДанных, СпособПоискаНоменклатуры, ЕдиницаИзмеренияНовойНоменклатуры = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	НЕ СпрНоменклатура.ЭтоГруппа";
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
		
	Для каждого ТекущаяСтрока из ТаблицаДанных Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			Продолжить;	
		КонецЕсли;
		
		ПоляПоискаШаг1 = "";
		Если СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ТолькоПоАртикулу
			И ЗначениеЗаполнено(ТекущаяСтрока.Артикул) Тогда
		    ПоляПоискаШаг1 = "Артикул";
		ИначеЕсли СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ПоАртикулуПоНаименованию
			И ЗначениеЗаполнено(ТекущаяСтрока.Артикул) Тогда
		    ПоляПоискаШаг1 = "Артикул";
		ИначеЕсли СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ТолькоПоНаименованию
			И ЗначениеЗаполнено(ТекущаяСтрока.Наименование) Тогда
		    ПоляПоискаШаг1 = "Наименование";
		ИначеЕсли СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ПоНаименованиюПоАртикулу
			И ЗначениеЗаполнено(ТекущаяСтрока.Наименование) Тогда
		    ПоляПоискаШаг1 = "Наименование";
		ИначеЕсли СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ПоАртикулуПоНаименованиюВместе
			И (ЗначениеЗаполнено(ТекущаяСтрока.Артикул) ИЛИ ЗначениеЗаполнено(ТекущаяСтрока.Наименование)) Тогда
		    ПоляПоискаШаг1 = "Артикул, Наименование";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоляПоискаШаг1) Тогда
			СтруктураПоиска = Новый Структура(ПоляПоискаШаг1);
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
			НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрока.Номенклатура = НайденныеСтроки[0].Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда			
			ПоляПоискаШаг2 = "";
			Если СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ПоАртикулуПоНаименованию
				И ЗначениеЗаполнено(ТекущаяСтрока.Наименование) Тогда
				ПоляПоискаШаг2 = "Наименование";
			ИначеЕсли СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ПоНаименованиюПоАртикулу
				И ЗначениеЗаполнено(ТекущаяСтрока.Артикул) Тогда
				ПоляПоискаШаг2 = "Артикул";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПоляПоискаШаг2) Тогда
				СтруктураПоиска = Новый Структура(ПоляПоискаШаг2);
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
				НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ТекущаяСтрока.Номенклатура = НайденныеСтроки[0].Номенклатура;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Нужно найти характеристику при наличии
		Если ЗначениеЗаполнено(ТекущаяСтрока.Характеристика)
			И ТекущаяСтрока.ХарактеристикаНоменклатуры.Пустая() 
			И НЕ ТекущаяСтрока.Номенклатура.Пустая() Тогда
			ТекущаяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ТекущаяСтрока.Характеристика, Истина,, ТекущаяСтрока.Номенклатура);
		КонецЕсли;

		// единица измерения
		Если ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмеренияСтрокой) Тогда
			ТекущаяСтрока.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущаяСтрока.ЕдиницаИзмеренияСтрокой, Истина);
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
				И НЕ ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения Тогда
				ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
			
		ИначеЕсли НЕ ЕдиницаИзмеренияНовойНоменклатуры = Неопределено Тогда
			ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзмеренияНовойНоменклатуры;
			
	    КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция СоздатьНоменклатуруПоТаблице(ДанныеКЗагрузке, ПараметрыЗагрузки)
	
	Если ПараметрыЗагрузки.ВидНовойНоменклатуры.Пустая() Тогда
		ТекстОшибки = "Не указан вид создаваемой номенклатуры";
		ЗафиксироватьОшибкуЗагрузки(ПараметрыЗагрузки.Ссылка, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
		
	Для Каждого ТекущаяСтрока Из ДанныеКЗагрузке Цикл	
		
		Если ТекущаяСтрока.ЕдиницаИзмерения.Пустая() Тогда
			Продолжить;
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда			
			
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			НоваяНоменклатура.Заполнить(Неопределено);
			НоваяНоменклатура.УстановитьНовыйКод(); // #16295
			НоваяНоменклатура.Наименование = ТекущаяСтрока.Наименование;
			НоваяНоменклатура.НаименованиеДляПечати = ?(ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеДляПечати), ТекущаяСтрока.НаименованиеДляПечати, ТекущаяСтрока.Наименование);
			НоваяНоменклатура.Артикул = ТекущаяСтрока.Артикул;
			НоваяНоменклатура.Родитель = ПараметрыЗагрузки.ГруппаНовойНоменклатуры;
			НоваяНоменклатура.ВидНоменклатуры = ПараметрыЗагрузки.ВидНовойНоменклатуры;				
			
			//Базовая ед. изм.
			НоваяНоменклатура.БазоваяЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
			
			Попытка
				НоваяНоменклатура.ОбменДанными.Загрузка = Истина;
				НоваяНоменклатура.Записать();				
			Исключение
				Продолжить;
			КонецПопытки;
			
			СтруктураПоиска = Новый Структура("Наименование, Артикул", ТекущаяСтрока.Наименование, ТекущаяСтрока.Артикул);
			ИдентичныеПозиции = ДанныеКЗагрузке.НайтиСтроки(СтруктураПоиска);
			Для каждого НайденнаяСтрока из ИдентичныеПозиции Цикл
				НайденнаяСтрока.Номенклатура = НоваяНоменклатура.Ссылка;
			КонецЦикла;
			
		ИначеЕсли ПараметрыЗагрузки.ОбновлятьДанныеНоменклатуры
			И ПараметрыЗагрузки.СпособПоискаНоменклатуры = Перечисления.СпособыПоискаНоменклатуры.ТолькоПоАртикулу Тогда
			
			СпрОбъект = ТекущаяСтрока.Номенклатура.ПолучитьОбъект();
			Если НЕ СпрОбъект.Наименование = ТекущаяСтрока.Наименование Тогда
				СпрОбъект.Наименование = ТекущаяСтрока.Наименование;
				СпрОбъект.НаименованиеДляПечати = ?(ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеДляПечати), ТекущаяСтрока.НаименованиеДляПечати, ТекущаяСтрока.Наименование);
				
				Попытка
					СпрОбъект.ОбменДанными.Загрузка = Истина;
					СпрОбъект.Записать();				
				Исключение
					Продолжить;
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		  		
		//Проверим / создадим характеристики
		Если ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда
			НайденнаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ТекущаяСтрока.Характеристика, Истина,,НоваяНоменклатура.Ссылка);
			Если НайденнаяХарактеристика.Пустая() Тогда
				НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
				НоваяХарактеристика.Владелец = ТекущаяСтрока.Номенклатура;
				НоваяХарактеристика.Наименование = ТекущаяСтрока.Характеристика;
				Попытка
					НоваяХарактеристика.Записать();
				Исключение
					
				КонецПопытки;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьУстановкуЦенПоТаблице(ДанныеКЗагрузке, ПараметрыЗагрузки)
	
	Если ПараметрыЗагрузки.ВидЦены.Пустая() Тогда
		ТекстОшибки = "Не указан вид цены";
		ЗафиксироватьОшибкуЗагрузки(ПараметрыЗагрузки.Ссылка, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаДанных = ДанныеКЗагрузке.Скопировать(, "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Цена");
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("ВидЦены", ПараметрыЗагрузки.ВидЦены);
	Запрос.УстановитьПараметр("ЗагружатьТолькоИзмененныеЦены", ПараметрыЗагрузки.ЗагружатьТолькоИзмененныеЦены);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаДанных.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаДанных.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	&ВидЦены КАК ВидЦены,
	|	ВТ.Цена КАК Цена
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ТекущиеЦены
	|		ПО (ТекущиеЦены.Номенклатура = ВТ.Номенклатура)
	|			И (ТекущиеЦены.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры)
	|			И (ТекущиеЦены.ЕдиницаИзмерения = ВТ.ЕдиницаИзмерения)
	|ГДЕ
	|	НЕ ВТ.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ЗагружатьТолькоИзмененныеЦены
	|				ТОГДА НЕ ВТ.Цена = ЕСТЬNULL(ТекущиеЦены.Цена, 0)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДокОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();	
	ДокОбъект.Заполнить(Неопределено);
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	ДокОбъект.НеРегистрировытьНулевыеЦены = Истина;
	ДокОбъект.Валюта = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	ДокОбъект.Комментарий = "#Загрузка данных из внешних источников#";
	
	НоваяСтрока = ДокОбъект.ВидыЦен.Добавить();
	НоваяСтрока.ВидЦены = ПараметрыЗагрузки.ВидЦены;
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		НоваяСтрока = ДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗафиксироватьОшибкуЗагрузки(ПараметрыЗагрузки.Ссылка, ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
